#### Terraform Plan for `30_app` layer
<details><summary>Show Plan</summary>

```
Acquiring state lock. This may take a few moments...
module.main.module.runtime_code_modules.module.practice_util.data.local_file.signatures: Reading...
module.main.module.runtime_code_modules.module.cron_server_package.data.local_file.signatures: Reading...
module.main.module.runtime_code_modules.module.api_server_package.data.local_file.signatures: Reading...
module.main.module.runtime_code_modules.module.worker_package.data.local_file.signatures: Reading...
module.main.module.runtime_code_modules.module.practice_util.data.local_file.signatures: Read complete after 0s [id=1d3cde1f97bee6b7ac5d1289ba8dfc5395e9959b]
module.main.module.runtime_code_modules.module.cron_server_package.data.local_file.signatures: Read complete after 0s [id=287d039cb6506b459a82296fb432e4406653d449]
module.main.module.runtime_code_modules.module.api_server_package.data.local_file.signatures: Read complete after 0s [id=07067372a298c32bf5246345fbaa1ac3605ac888]
module.main.module.runtime_code_modules.module.worker_package.data.local_file.signatures: Read complete after 0s [id=97002abb2822b5614c7b8044bbcc622710bb1766]
data.aws_caller_identity.current: Reading...
module.main.data.aws_region.current: Reading...
module.main.module.api_server.module.lambda_fastapi_server.aws_cloudwatch_log_group.lambda_logs: Refreshing state... [id=/aws/lambda/tt-practice-dev-api-server]
module.main.data.aws_caller_identity.current: Reading...
module.main.module.eventbridge_target[0].aws_iam_role.eventbridge: Refreshing state... [id=tt-practice-dev-eventbridge-target-role]
module.main.module.runtime_code_modules.module.practice_util.aws_lambda_layer_version.dependencies_layer: Refreshing state... [id=arn:aws:lambda:ap-southeast-1:057336397237:layer:practice_util_dependencies:1]
module.main.module.runtime_code_modules.module.cron_server_package.aws_lambda_layer_version.dependencies_layer: Refreshing state... [id=arn:aws:lambda:ap-southeast-1:057336397237:layer:cron_server_dependencies:1]
module.main.module.runtime_code_modules.module.worker_package.aws_lambda_layer_version.dependencies_layer: Refreshing state... [id=arn:aws:lambda:ap-southeast-1:057336397237:layer:worker_dependencies:1]
module.main.module.worker.module.lambda_sqs_worker.aws_cloudwatch_log_group.lambda_logs: Refreshing state... [id=/aws/lambda/tt-practice-dev-worker]
module.main.data.aws_region.current: Read complete after 0s [id=ap-southeast-1]
module.main.module.runtime_code_modules.module.api_server_package.aws_lambda_layer_version.dependencies_layer: Refreshing state... [id=arn:aws:lambda:ap-southeast-1:057336397237:layer:api_server_dependencies:1]
module.main.module.cron_server.module.lambda_cron_server.aws_cloudwatch_log_group.lambda_logs: Refreshing state... [id=/aws/lambda/tt-practice-dev-cron-server]
data.aws_caller_identity.current: Read complete after 0s [id=057336397237]
data.terraform_remote_state.infra: Reading...
module.main.data.aws_caller_identity.current: Read complete after 0s [id=057336397237]
data.terraform_remote_state.infra: Read complete after 2s
module.main.module.worker.module.lambda_sqs_worker.aws_lambda_function.sqs_worker: Refreshing state... [id=tt-practice-dev-worker]
module.main.module.cron_server.module.lambda_cron_server.aws_lambda_function.cron_server: Refreshing state... [id=tt-practice-dev-cron-server]
module.main.module.api_server.module.lambda_fastapi_server.aws_lambda_function.fastapi_server: Refreshing state... [id=tt-practice-dev-api-server]
module.main.module.eventbridge_target[0].aws_iam_role_policy.invoke_lambda: Refreshing state... [id=tt-practice-dev-eventbridge-target-role:tt-practice-dev-eventbridge-target-role-invoke-lambda]
module.main.module.eventbridge_target[0].aws_scheduler_schedule.this: Refreshing state... [id=default/tt-practice-dev-cron-producer-schedule]
module.main.module.worker.module.lambda_sqs_worker.aws_lambda_event_source_mapping.sqs_trigger: Refreshing state... [id=900345ef-f86a-4d42-9e3a-57c5ceceaa63]
module.main.module.api_gateway_integration[0].aws_lambda_permission.api_gateway: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.main.module.api_gateway_integration[0].aws_apigatewayv2_integration.lambda: Refreshing state... [id=rjr1tnj]
module.main.module.api_gateway_integration[0].aws_apigatewayv2_route.default: Refreshing state... [id=g7qk7hk]
module.main.module.api_gateway_integration[0].aws_apigatewayv2_route.routes["GET /users"]: Refreshing state... [id=lp3rnuq]
module.main.module.api_gateway_integration[0].aws_apigatewayv2_route.routes["GET /events"]: Refreshing state... [id=armi4rm]
module.main.module.api_gateway_integration[0].aws_apigatewayv2_route.routes["POST /events"]: Refreshing state... [id=0hygo41]
module.main.module.api_gateway_integration[0].aws_apigatewayv2_route.routes["POST /users"]: Refreshing state... [id=22o4w9u]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # module.main.module.api_server.module.lambda_fastapi_server.aws_lambda_function.fastapi_server will be updated in-place
  ~ resource "aws_lambda_function" "fastapi_server" {
      ~ filename                       = "/home/trungle/Desktop/training/github/terraform-training/practice/out/api_server/lambda_app.zip" -> "/home/runner/work/terraform-training/terraform-training/practice/out/api_server/lambda_app.zip"
        id                             = "tt-practice-dev-api-server"
      ~ last_modified                  = "2025-11-10T15:03:38.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-1:057336397237:layer:practice_util_dependencies:1",
          - "arn:aws:lambda:ap-southeast-1:057336397237:layer:api_server_dependencies:1",
        ] -> (known after apply)
      ~ source_code_hash               = "NWEwNDhmODlmODA1MjQ1OTkzZWI5MjFiZjAyYjg4MzJlMjdiYjMzMjllNTlkMTZiY2VkYTYxOWZhNjQ2NGM2Mw==" -> "NjFjOGFjZDQ0NTk0NWQ4MzA2ZjY3MTg5MTU0ZmMzY2ZkMTUyM2QyZjliYmExNjBlMWYwYWM3YzcxNTViZGM0OQ=="
        tags                           = {
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Project"     = "tt-practice"
        }
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.main.module.cron_server.module.lambda_cron_server.aws_lambda_function.cron_server will be updated in-place
  ~ resource "aws_lambda_function" "cron_server" {
      ~ filename                       = "/home/trungle/Desktop/training/github/terraform-training/practice/out/cron_server/lambda_app.zip" -> "/home/runner/work/terraform-training/terraform-training/practice/out/cron_server/lambda_app.zip"
        id                             = "tt-practice-dev-cron-server"
      ~ last_modified                  = "2025-11-10T15:03:44.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-1:057336397237:layer:practice_util_dependencies:1",
          - "arn:aws:lambda:ap-southeast-1:057336397237:layer:cron_server_dependencies:1",
        ] -> (known after apply)
      ~ source_code_hash               = "NDdkY2RmMTE0N2FiMmM3OWI2ZTJjNTFmZjA5MDNjYjUwMTQzMTlhYjA0ZTRhOTlhYzE3NjliYmUwMzkxNmVkOQ==" -> "YTYwMTQ4YTBjN2RiMjYyNjg3ZjY0ODc0YmM0NDZjZjc2YjM0NzRhMGFiNjU2OTZlMGY0ODRiMTMwNzdhYTU4Yw=="
        tags                           = {
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Project"     = "tt-practice"
        }
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.main.module.runtime_code_modules.module.api_server_package.aws_lambda_layer_version.dependencies_layer must be replaced
-/+ resource "aws_lambda_layer_version" "dependencies_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-1:057336397237:layer:api_server_dependencies:1" -> (known after apply)
      ~ code_sha256                 = "J7Zjon8rFe60tuwu8mIheZRBJlJrn2SK7H24WjVqO+E=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-11-10T15:03:24.784+0000" -> (known after apply)
      ~ filename                    = "/home/trungle/Desktop/training/github/terraform-training/practice/out/api_server/lambda_layer.zip" -> "/home/runner/work/terraform-training/terraform-training/practice/out/api_server/lambda_layer.zip" # forces replacement
      ~ id                          = "arn:aws:lambda:ap-southeast-1:057336397237:layer:api_server_dependencies:1" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-1:057336397237:layer:api_server_dependencies" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "J7Zjon8rFe60tuwu8mIheZRBJlJrn2SK7H24WjVqO+E=" -> "ZmP+duk5qIsNON1/wPSdL9nlJt+BsYypwcXHT/B/HVk=" # forces replacement
      ~ source_code_size            = 15198683 -> (known after apply)
      ~ version                     = "1" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.main.module.runtime_code_modules.module.cron_server_package.aws_lambda_layer_version.dependencies_layer must be replaced
-/+ resource "aws_lambda_layer_version" "dependencies_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-1:057336397237:layer:cron_server_dependencies:1" -> (known after apply)
      ~ code_sha256                 = "S3HnrDXYdGBgCT3IfdXo1VE4cp99agHwdU2SadHYjAg=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-11-10T15:03:19.704+0000" -> (known after apply)
      ~ filename                    = "/home/trungle/Desktop/training/github/terraform-training/practice/out/cron_server/lambda_layer.zip" -> "/home/runner/work/terraform-training/terraform-training/practice/out/cron_server/lambda_layer.zip" # forces replacement
      ~ id                          = "arn:aws:lambda:ap-southeast-1:057336397237:layer:cron_server_dependencies:1" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-1:057336397237:layer:cron_server_dependencies" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "S3HnrDXYdGBgCT3IfdXo1VE4cp99agHwdU2SadHYjAg=" -> "Xid9zE2dYkq9qD+msmUdGT9ukgxp6TnXnJKU6y3Lkcs=" # forces replacement
      ~ source_code_size            = 15198683 -> (known after apply)
      ~ version                     = "1" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.main.module.runtime_code_modules.module.practice_util.aws_lambda_layer_version.dependencies_layer must be replaced
-/+ resource "aws_lambda_layer_version" "dependencies_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-1:057336397237:layer:practice_util_dependencies:1" -> (known after apply)
      ~ code_sha256                 = "NcpClwjTeeX3kk9oi0wbIq6KA3v/ibsYjpwGbS6+yJ8=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-11-10T15:03:32.772+0000" -> (known after apply)
      ~ filename                    = "/home/trungle/Desktop/training/github/terraform-training/practice/out/practice_util/lambda_layer.zip" -> "/home/runner/work/terraform-training/terraform-training/practice/out/practice_util/lambda_layer.zip" # forces replacement
      ~ id                          = "arn:aws:lambda:ap-southeast-1:057336397237:layer:practice_util_dependencies:1" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-1:057336397237:layer:practice_util_dependencies" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "NcpClwjTeeX3kk9oi0wbIq6KA3v/ibsYjpwGbS6+yJ8=" -> "z26x037x70b810dhIf1ouSZTnc51oawF13L18EsrK8Y=" # forces replacement
      ~ source_code_size            = 15201284 -> (known after apply)
      ~ version                     = "1" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.main.module.runtime_code_modules.module.worker_package.aws_lambda_layer_version.dependencies_layer must be replaced
-/+ resource "aws_lambda_layer_version" "dependencies_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-1:057336397237:layer:worker_dependencies:1" -> (known after apply)
      ~ code_sha256                 = "GWmc+c1l/xdt/B004a2Fw4hNnscsz5+6P9wP+o9MIWQ=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-11-10T15:03:28.777+0000" -> (known after apply)
      ~ filename                    = "/home/trungle/Desktop/training/github/terraform-training/practice/out/worker/lambda_layer.zip" -> "/home/runner/work/terraform-training/terraform-training/practice/out/worker/lambda_layer.zip" # forces replacement
      ~ id                          = "arn:aws:lambda:ap-southeast-1:057336397237:layer:worker_dependencies:1" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-1:057336397237:layer:worker_dependencies" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "GWmc+c1l/xdt/B004a2Fw4hNnscsz5+6P9wP+o9MIWQ=" -> "wVNW//mj0sP2ef09kbfwE6sPEEZM/knRRo2cbgB+bbM=" # forces replacement
      ~ source_code_size            = 15198683 -> (known after apply)
      ~ version                     = "1" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.main.module.worker.module.lambda_sqs_worker.aws_lambda_function.sqs_worker will be updated in-place
  ~ resource "aws_lambda_function" "sqs_worker" {
      ~ filename                       = "/home/trungle/Desktop/training/github/terraform-training/practice/out/worker/lambda_app.zip" -> "/home/runner/work/terraform-training/terraform-training/practice/out/worker/lambda_app.zip"
        id                             = "tt-practice-dev-worker"
      ~ last_modified                  = "2025-11-10T15:03:50.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-1:057336397237:layer:practice_util_dependencies:1",
          - "arn:aws:lambda:ap-southeast-1:057336397237:layer:worker_dependencies:1",
        ] -> (known after apply)
      ~ source_code_hash               = "OTdhZTAyMjk2OTkzMzliNmFhMGUwY2Q0YTE1ZTYzZThmODRkNTA1N2IyZGY0ZTQ3NzU5ZDZjNmI4MmViODM4OQ==" -> "YmY5MzJmMjdjNjVkMmI5N2JhZmU1YjhlZWQ1OTg5MWNlYjA2ZGY3NzAwODBkNWQ1MzZiYTVmMDQ5NzcwZTdkMg=="
        tags                           = {
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Project"     = "tt-practice"
        }
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 4 to add, 3 to change, 4 to destroy.

Error: reading Lambda Event Source Mapping (900345ef-f86a-4d42-9e3a-57c5ceceaa63): operation error Lambda: GetEventSourceMapping, https response error StatusCode: 403, RequestID: 422f1476-c4dc-4695-ac57-8257c13cbf3f, api error AccessDeniedException: User: arn:aws:sts::057336397237:assumed-role/tt-practice-dev-terraform-plan/GitHubActions-Terraform-19293602905 is not authorized to perform: lambda:GetEventSourceMapping on resource: arn:aws:lambda:ap-southeast-1:057336397237:event-source-mapping:900345ef-f86a-4d42-9e3a-57c5ceceaa63 because no identity-based policy allows the lambda:GetEventSourceMapping action

  with module.main.module.worker.module.lambda_sqs_worker.aws_lambda_event_source_mapping.sqs_trigger,
  on ../../../components/lambda_sqs_worker/main.tf line 41, in resource "aws_lambda_event_source_mapping" "sqs_trigger":
  41: resource "aws_lambda_event_source_mapping" "sqs_trigger" {

Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @trungleviet-agilityio, Action: `pull_request`, Working Directory: `practice/deploy/30_app/environments/dev`, Workflow: `Terraform CI`*